# ML Project using regression and Estimate the Value of the houses

In [150]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import pylab as pl
import statistics

In [151]:
df = pd.read_csv("data.csv")
df.head()

,Area,Room,Parking,Warehouse,Elevator,Address,Price,Price(USD)
0,63,1,True,True,True,Shahran,1.850000e+09,61666.67
1,60,1,True,True,True,Shahran,1.850000e+09,61666.67
2,79,2,True,True,True,Pardis,5.500000e+08,18333.33
3,95,2,True,True,True,Shahrake Qods,9.025000e+08,30083.33
4,123,2,True,True,True,Shahrake Gharb,7.000000e+09,233333.33

In [152]:
# df["Area"] = df["Area"].str.replace(",", "")
# for i in range(len(df["Area"])):
#     df["Area"][i] = df["Area"][i].strip()
df["Area"] = df["Area"].str.replace(",", "").str.strip()
df["Area"] = pd.to_numeric(df["Area"])
# df["Area"][570]
# pd.to_numeric(df["Area"])

In [153]:
df.describe()

               Area         Room         Price    Price(USD)
count  3.479000e+03  3479.000000  3.479000e+03  3.479000e+03
mean   8.744000e+06     2.079908  5.359023e+09  1.786341e+05
std    3.167266e+08     0.758275  8.099935e+09  2.699978e+05
min    3.000000e+01     0.000000  3.600000e+06  1.200000e+02
25%    6.900000e+01     2.000000  1.418250e+09  4.727500e+04
50%    9.000000e+01     2.000000  2.900000e+09  9.666667e+04
75%    1.200000e+02     2.000000  6.000000e+09  2.000000e+05
max    1.616000e+10     5.000000  9.240000e+10  3.080000e+06

In [154]:
df = df[df["Area"] <= 500]
df.describe()

              Area         Room         Price    Price(USD)
count  3456.000000  3456.000000  3.456000e+03  3.456000e+03
mean    103.893808     2.072917  5.192338e+09  1.730779e+05
std      55.459909     0.746943  7.385237e+09  2.461746e+05
min      30.000000     0.000000  3.600000e+06  1.200000e+02
25%      68.000000     2.000000  1.400000e+09  4.666667e+04
50%      90.000000     2.000000  2.850000e+09  9.500000e+04
75%     120.000000     2.000000  6.000000e+09  2.000000e+05
max     500.000000     5.000000  9.240000e+10  3.080000e+06

In [155]:
df.isnull().sum()

Area           0
Room           0
Parking        0
Warehouse      0
Elevator       0
Address       23
Price          0
Price(USD)     0
dtype: int64

In [156]:
df = df[df["Address"].isnull() == False]
df.isnull().sum()

Area          0
Room          0
Parking       0
Warehouse     0
Elevator      0
Address       0
Price         0
Price(USD)    0
dtype: int64

In [157]:
len(df)

3433

In [158]:
Q1 = df["Price"].quantile(0.25)
Q3 = df["Price"].quantile(0.75)
IQR = Q3 - Q1
UpperBound = Q3 + 5 * IQR
LowerBound = Q1 - 1.5 * IQR
print("Upperbound is : ", UpperBound , "LowerBound is :", LowerBound)

Upperbound is :  29000000000.0 LowerBound is : -5500000000.0

In [159]:
df = df[df["Price"].values <= UpperBound ]
df.describe()

              Area         Room         Price     Price(USD)
count  3361.000000  3361.000000  3.361000e+03    3361.000000
mean    100.133294     2.042547  4.416205e+09  147206.843267
std      48.437356     0.716081  4.676469e+09  155882.313533
min      30.000000     0.000000  3.600000e+06     120.000000
25%      68.000000     2.000000  1.380000e+09   46000.000000
50%      90.000000     2.000000  2.800000e+09   93333.330000
75%     117.000000     2.000000  5.600000e+09  186666.670000
max     500.000000     5.000000  2.900000e+10  966666.670000

In [160]:
print(df.dtypes)

Area            int64
Room            int64
Parking          bool
Warehouse        bool
Elevator         bool
Address        object
Price         float64
Price(USD)    float64
dtype: object

In [161]:
df['Parking'] = df['Parking'].astype(int)

In [162]:
print(df['Address'].nunique())

190

In [163]:
# Calculate average price per address
address_price = df.groupby('Address')['Price'].mean().sort_values()

# Create a mapping dictionary
address_mapping = {address: idx for idx, address in enumerate(address_price.index)}

# Apply mapping
df['Address_Encoded'] = df['Address'].map(address_mapping)

In [164]:
df

,Area,Room,Parking,Warehouse,Elevator,Address,Price,Price(USD),Address_Encoded
0,63,1,1,True,True,Shahran,1.850000e+09,61666.67,99
1,60,1,1,True,True,Shahran,1.850000e+09,61666.67,99
2,79,2,1,True,True,Pardis,5.500000e+08,18333.33,15
3,95,2,1,True,True,Shahrake Qods,9.025000e+08,30083.33,26
4,123,2,1,True,True,Shahrake Gharb,7.000000e+09,233333.33,177
...,...,...,...,...,...,...,...,...,...
3474,86,2,1,True,True,Southern Janatabad,3.500000e+09,116666.67,107
3475,83,2,1,True,True,Niavaran,6.800000e+09,226666.67,185
3476,75,2,0,False,False,Parand,3.650000e+08,12166.67,5
3477,105,2,1,True,True,Dorous,5.600000e+09,186666.67,176
3478,82,2,0,True,True,Parand,3.600000e+08,12000.00,5

In [167]:
# Features - everything except Price and the original Address column
X = df[['Area', 'Room', 'Parking', 'Warehouse', 'Elevator', 'Address_Encoded']]

# Target - what you want to predict
Y = df['Price']

# Check shapes
print(f"Features shape: {X.shape}")
print(f"Target shape: {y.shape}")

Features shape: (3361, 6)
Target shape: (3361,)

In [169]:
msk = np.random.rand(len(X)) < 0.8
X_Train = X[msk]
X_Test = X[~msk]
Y_Train = Y[msk]
Y_Test = Y[~msk]
print(f"Features shape Train: {X_Train.shape}")
print(f"Features shape Test: {X_Test.shape}")
print(f"Target shape Test: {Y_Test.shape}")
print(f"Target shape Train: {Y_Train.shape}")

Features shape Train: (2666, 6)
Features shape Test: (695, 6)
Target shape Test: (695,)
Target shape Train: (2666,)